OpenFOAM/sampleC/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;//ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    runTime;

writeInterval   500;

purgeWrite      0;

writeFormat     binary;//ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

// ************************************************************************* //

functions
{
//	#includeFunc	flowRatePatch(name=outlet)
//	pressureDifferencePatch
  //      {
  //              patch1 inlet;
  //              patch2 outlet;
  //              #includeEtc "caseDicts/postProcessing/pressure/pressureDifferencePatch.cfg"
  //      }
  probe_inlet
  {
	#includeEtc "caseDicts/postProcessing/probes/probes.cfg"
        fields (p);
        probeLocations
        (
        	(-0.04986  0.02265 0.01462)
        );
  }
};

libs ("libmyFiniteVolume.so");
 
